docs/campaigns/F14-cooling-ladder/K2e_runs/m48_dT3_bou/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.00000 0.00000 0.00000)
    (0.10000 0.00000 0.00000)
    (0.00000 0.10000 0.00000)
    (0.10000 0.10000 0.00000)
    (0.00000 0.00000 0.01000)
    (0.10000 0.00000 0.01000)
    (0.00000 0.10000 0.01000)
    (0.10000 0.10000 0.01000)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (48 48 1) simpleGrading (1 1 1)
);

edges();

boundary
(
    hotWall
    {
        type wall;
        faces ( (0 4 6 2) );
    }
    coldWall
    {
        type wall;
        faces ( (1 3 7 5) );
    }
    adiabaticWalls
    {
        type wall;
        faces ( (0 1 5 4) (2 6 7 3) );
    }
    frontAndBack
    {
        type empty;
        faces ( (0 2 3 1) (4 5 7 6) );
    }
);

// ************************************************************************* //
